{
   "intents": [
      {
         "tag": "greeting",
         "patterns": [
            "Hi",
            "Hii",
            "Hiiii",
            "Hiii",
            "How are you?",
            "Is anyone there?",
            "Hello",
            "Good day",
            "What's up",
            "how are ya",
            "heyy",
            "whatsup",
            "Hey there",
            "Good morning",
            "Good afternoon",
            "Good evening",
            "How are you?",
            "What's up?",
            "How's it going?",
            "Nice to meet you",
            "Hey",
            "Yo",
            "What's happening?",
            "Howdy",
            "Good to see you",
            "How's your day going?",
            "Greetings",
            "What's new?",
            "Pleased to meet you"
         ],
         "responses": [
            "Hello!",
            "Good to see you again!",
            "Hi there, how can I help?",
            "Hi!",
            "Hey, what's up?",
            "Good morning to you too!",
            "Good afternoon!",
            "Good evening!",
            "I'm doing well, thanks for asking. How about you?",
            "Not much, just hanging out. How about you?",
            "It's going well, thanks. How about you?",
            "Nice to meet you too!",
            "Hey, how's it going?",
            "Yo, what's up?",
            "Not much, just chilling. How about you?",
            "Howdy, partner!",
            "Good to see you too!",
            "My day's going pretty well, thanks for asking. How about yours?",
            "Greetings to you too!",
            "Nothing much, just trying to stay busy. How about you?",
            "Pleased to meet you as well!",
            "I'm glad to have met you as well!",
            "Not much, just trying to keep myself busy. What say you?",
            "Thank you for inquiring how my day is going. Describe yours, please."
         ],
         "context_set": ""
      },
      {
         "tag": "goodbye",
         "patterns": [
            "cya",
            "see you",
            "bye bye",
            "See you later",
            "Goodbye",
            "I am Leaving",
            "Bye",
            "Have a Good day",
            "talk to you later",
            "ttyl",
            "i got to go",
            "gtg",
            "Farewell",
            "Adios",
            "Take care",
            "Until next time",
            "So long",
            "Hasta luego",
            "Catch you later",
            "Have a nice day",
            "Leaving now",
            "Bye for now",
            "Goodnight",
            "See you soon",
            "Be seeing you"
         ],
         "responses": [
            "Sad to see you go :(",
            "Talk to you later",
            "Goodbye!",
            "Come back soon",
            "Farewell, it was nice talking to you!",
            "Adios, take care!",
            "Take care, see you soon!",
            "Until next time, have a great day!",
            "So long, it was a pleasure chatting with you!",
            "Hasta luego, amigo!",
            "Catch you later, have a good one!",
            "Have a nice day too!",
            "Safe travels, bye for now!",
            "Goodnight, sweet dreams!",
            "See you soon, can't wait to talk again!",
            "Be seeing you, have a great day!",
            "It was a pleasure speaking with you; good-bye!",
            "Be careful, talk to you soon.",
            "Good night, and happy dreams!",
            "Goodbye! It was a pleasure speaking with you."
         ],
         "context_set": ""
      },
      {
         "tag": "creator",
         "patterns": [
            "what is the name of the developers",
            "what is the name of the creators",
            "your developers",
            "your creators",
            "who are your developers",
            "Identify your developers.",
            "you are made by",
            "You are created by",
            "you are made by whom",
            "Who formed you, and how?",
            "who created you",
            "who create you",
            "who made you",
            "who designed you",
            "who programmed you?"
         ],
         "responses": [
            "I was created by a team of college students",
            "My developers prefer to remain anonymous",
            "I was made by a group of young innovators",
            "My creators are a team of talented individuals",
            "My development team is a group of tech enthusiasts",
            "The identity of my creators is classified information",
            "I was designed by a group of aspiring engineers",
            "My developers are a team of bright minds",
            "I was created by a team of software engineers",
            "My creators are a group of tech-savvy individuals",
            "I was made by a team of coding enthusiasts",
            "The team that created me wishes to remain anonymous",
            "I was created by a team of developers at college.",
            "My creators are a team of brilliant minds at College.",
            "I was designed and built by a team of programmers at college."
         ],
         "context_set": ""
      },
      {
         "tag": "name",
         "patterns": [
            "name",
            "your name",
            "do you have a name",
            "what are you called",
            "what is your name",
            "what should I call you",
            "whats your name?",
            "what are you",
            "who are you",
            "who is this",
            "what am i chatting to",
            "who am i taking to",
            "what are you"
         ],
         "responses": [
            "My name is VITCHAT.",
            "You can call me VITCHAT.",
            "I'm a VITCHAT designed to assist you in you regarding VIT-AP.",
            "I am here to help you, you can call me VITCHAT.",
            "I'm VITCHAT, a virtual assistant here to help you.",
            "My name is VITCHAT and I am a chatbot programmed to assist you.",
            "I go by the name VITCHAT, how can I assist you today?",
            "I am your virtual assistant, VITCHAT.",
            "I am VITCHAT, a chatbot designed to assist you with your needs.",
            "You are chatting with VITCHAT, how may I assist you today?",
            "I'm VITCHAT, a digital assistant at your service.",
            "My name is VITCHAT, what can I help you with today?",
            "I'm an AI-powered chatbot named VITCHAT, how can I assist you?",
            "You're talking to VITCHAT, your virtual assistant.",
            "I am VITCHAT, your personal chatbot assistant.",
            "My name is VITCHAT, I'm here to help you with whatever you need."
         ],
         "context_set": ""
      },
      {
         "tag": "hours",
         "patterns": [
            "timing of college",
            "what is college timing",
            "working days",
            "when are you guys open",
            "what are your hours",
            "hours of operation",
            "when is the college open",
            "college timing",
            "what about college timing",
            "is college open on saturday",
            "tell something about college timing",
            "what is the college  hours",
            "when should i come to college",
            "when should i attend college",
            "what is my college time",
            "college timing",
            "timing college"
         ],
         "responses": [
            "The college timing is from 9:00 AM to 7:00 PM.",
            "The college operates from 9:00 in the morning until 7:00 in the evening.",
            "Classes start at 9:00 and end at 7:00 PM.",
            "You can expect the college to be open from 9:00 until 7:00 in the evening.",
            "The college operates during normal business hours, from 9:00 AM to 7:00 PM.",
            "The timings of the college are 9:00 AM to 7:00 PM, Tuesday to Saturday.",
            "The college hours are from 9:00 in the morning until 7:00 PM in the evening.",
            "The college is open from 9:00 to 7:00 PM on weekdays.",
            "Classes at the college begin at 9:00 AM and finish at 7:00 PM.",
            "The college's operating hours are from 9:00 to 7:00 PM, Tuesday through Saturday.",
            "The timings of the college are set from 9:00 in the morning until 7:00 in the evening.",
            "You can expect the college to be open from 9:00 to 7:00 on weekdays.",
            "College timing starts from 9:00 AM and runs until 7:00 PM every day.",
            "The hours of the college are from 9:00 in the morning to 7:00 in the evening on weekdays.",
            "The college timings are from 9:00 AM until 7:00 PM, Tuesday to Saturday.",
            "The college operates from 9:00 in the morning to 7:00 in the evening, every weekday.",
            "You can visit the college between 9:00 AM and 7:00 PM on weekdays."
         ],
         "context_set": ""
      },
      {
         "tag": "course",
         "patterns": [
            "What are the majors available at UNI?",
            "List of majors",
            "What are the degrees offered at UNI?",
            "What kind of programs does your college have?",
            "Can you tell me about your academic programs?",
            "What are the academic offerings at UNI?",
            "Which courses are the most popular at UNI?",
            "Which majors are the most popular at UNI?",
            "Which departments are there at UNI?",
            "What kind of engineering programs do you have?",
            "Are there any business programs at UNI?",
            "What are the science programs available at UNI?",
            "What kind of healthcare programs are offered at UNI?",
            "Which technology programs are offered at UNI?",
            "Can you tell me about the computer science program at UNI?",
            "What is the syllabus for the civil engineering program?",
            "Can you tell me about the curriculum for the chemical engineering program?",
            "Are there any research programs available at UNI?",
            "What are the postgraduate programs available at UNI?",
            "Are there any online programs available at UNI?",
            "What kind of certifications does UNI offer?",
            "Can you tell me about the dual degree programs at UNI?"
         ],
         "responses": [
            "We offer majors in computer science, information technology, mechanical engineering, chemical engineering, civil engineering, electrical engineering, and business administration.",
            "Our degrees include Bachelor of Science, Bachelor of Arts, Master of Science, and Doctorate in various fields.",
            "We have programs in engineering, business, science, healthcare, and technology.",
            "We offer academic programs across various departments, including engineering, business, science, and humanities.",
            "Our academic offerings include undergraduate, graduate, and postgraduate programs in various fields.",
            "Our most popular courses include computer science, business administration, and mechanical engineering.",
            "Our most popular majors include computer science, business administration, and mechanical engineering.",
            "Our departments include engineering, business, science, and humanities.",
            "We offer engineering programs in computer science, mechanical engineering, chemical engineering, civil engineering, and electrical engineering.",
            "We offer business programs in various fields, including marketing, finance, and management.",
            "Our science programs include biology, chemistry, physics, and environmental science.",
            "We offer healthcare programs in nursing, pharmacy, and public health.",
            "Our technology programs include computer science, information technology, and data science.",
            "Our computer science program covers topics such as algorithms, programming languages, and artificial intelligence.",
            "The civil engineering program covers topics such as structural analysis, design, and construction.",
            "The chemical engineering program covers topics such as thermodynamics, reaction engineering, and process design.",
            "We offer research programs in various fields, including engineering, business, and science.",
            "Our postgraduate programs include Master of Science, Master of Business Administration, and Msc. DataScience in various fields.",
            "We offer online programs in various fields, including business administration and information technology.",
            "We offer various certifications in fields such as project management and information security.",
            "Our dual degree programs include engineering and business administration, engineering and law, and engineering and computer science."
         ],
         "context_set": ""
      },
      {
         "tag": "fees",
         "patterns": [
            "information about fee",
            "information on fee",
            "tell me the fee",
            "college fee",
            "fee per semester",
            "what is the fee of each semester",
            "what is the fees of each year",
            "what is fee",
            "what is the fees",
            "how much is the fees",
            "fees for first year",
            "fees",
            "about the fees",
            "tell me something about the fees",
            "What is the fees of hostel",
            "how much is the fees",
            "hostel fees",
            "fees for AC room",
            "fees for non-AC room",
            "fees for Ac room for girls",
            "fees for non-Ac room for girls",
            "fees for Ac room for boys",
            "fees for non-Ac room for boys"
         ],
         "responses": [
            "The fees vary based on the branch/stream you choose.",
            "Fees for different branches/streams may differ",
            "The fees for each branch/stream are listed on our college website.<a href=\"#\">Fee Structure</a>",
            "It would be best to check with the college administration for specific fee information.",
            "The fees for each branch/stream are different due to various factors like faculty, facilities, etc.",
            "Each branch/stream has a different fee structure, would you like me to provide more details?",
            "The fees for each branch/stream are determined by the college board of directors.",
            "I can provide you with a list of fees for each branch/stream if that would be helpful.",
            "The fees for each branch/stream are reviewed annually by the college board.",
            "Fees for different branches/streams may be subject to change from year to year.",
            "The fees for each branch/stream are based on the level of resources required for that particular program.",
            "The fees for each branch/stream reflect the cost of delivering that program.",
            "The fees for each branch/stream are decided based on the market demand for that particular program.",
            "Each branch/stream has a unique fee structure, which is set based on the number of courses required.",
            "The fees for each branch/stream are dependent on the type of courses required for that program.",
            "The fees for each branch/stream vary based on the level of technology and infrastructure required.",
            "The fees for each branch/stream are different due to the varying cost of providing the required laboratory facilities.",
            "Fees for different branches/streams may be set differently to attract more students.",
            "The fees for each branch/stream reflect the quality of faculty and resources available.",
            "The fees for each branch/stream are different due to the varying duration of the program.",
            "The fees for each branch/stream are different due to the varying level of accreditation.",
            "The fees for each branch/stream are reviewed annually by the regulatory board.",
            "The fees for each branch/stream are different due to the varying degree of specialization required.",
            "The fees for each branch/stream are based on the number of credits required for that program.",
            "The fees for each branch/stream are set based on the cost of developing and maintaining the curriculum."
         ],
         "context_set": ""
      },
      {
         "tag": "location",
         "patterns": [
            "where can I find the college",
            "directions to college",
            "How do I get to the college?",
            "Can you tell me the location of the college?",
            "Where is the college situated?",
            "What is the address of the college?",
            "Is the college located in the city center?",
            "Can you provide directions to the college?",
            "What are the landmarks near the college?",
            "How far is the college from the train station?",
            "Does the college have a parking lot?",
            "What is the nearest bus stop to the college?",
            "Which street is the college on?",
            "How long does it take to reach the college from the airport?",
            "What is the easiest way to reach the college?",
            "Does the college have a map or brochure?",
            "What are the surrounding neighborhoods of the college?",
            "Is the college located in a residential or commercial area?",
            "Can you recommend a taxi service to take me to the college?",
            "Does the college offer any shuttle services?",
            "What is the best time to visit the college?",
            "Are there any entrance restrictions to the college?",
            "Can I schedule a campus tour in advance?",
            "Is there any visitor parking available at the college?",
            "Can you provide any safety tips for traveling to the college?",
            "Are there any construction or roadwork projects near the college that I should be aware of?",
            "how to get to college",
            "nearest metro station to college",
            "nearest bus stop to college",
            "how far is the college from (landmark)",
            "what is the distance of college from (landmark)",
            "how to reach college from (location)",
            "college location",
            "college address",
            "wheres the college",
            "how can I reach college",
            "whats is the college address",
            "what is the address of college",
            "address",
            "location"
         ],
         "responses": [
            "You can reach VIT-AP University by car or public transportation.",
            "VIT-AP University is located in Inavolu, Amaravati, the capital of Andhra Pradesh, India.",
            "VIT-AP University is situated in Inavolu, Amaravati, the capital of Andhra Pradesh, India.",
            "The address of VIT-AP University is VIT-AP University, Inavolu, Amaravati, Andhra Pradesh 522237, India",
            "VIT-AP University is not located in the city center but is easily accessible from Amaravati.",
            "You can find directions to VIT-AP University on their website or by using a map app.",
            "Some of the landmarks near VIT-AP University include the Indira Gandhi Municipal Stadium and the Amaravati Buddhist Heritage Site.",
            "The distance between the VIT-AP University and the nearest train station is about 15 kilometers.",
            "Yes, VIT-AP University has a parking lot available for students and visitors.",
            "The nearest bus stop to VIT-AP University is the Inavolu Bus Stop, which is located about 1 kilometer away.",
            "VIT-AP University is located on the NH16 highway.",
            "It takes about 1.5 hours to reach VIT-AP University from the nearest airport, Vijayawada International Airport.",
            "The easiest way to reach VIT-AP University is by car or taxi.",
            "Yes, VIT-AP University has a map and brochure available on their website.",
            "The surrounding neighborhoods of VIT-AP University include Inavolu, Amaravati, and nearby villages.",
            "VIT-AP University is located in a residential area",
            "Some recommended taxi services to take you to VIT-AP University include Ola, Uber, and Meru Cabs.",
            "Yes, VIT-AP University offers shuttle services to students and faculty.",
            "The best time to visit VIT-AP University is during the academic year, which runs from August to May",
            "Yes, visitors must have a valid ID to enter VIT-AP University.",
            "Yes, you can schedule a campus tour in advance by contacting VIT-AP University's admissions office."
         ],
         "context_set": ""
      },
      {
         "tag": "hostel",
         "patterns": [
            "hostel facility",
            "hostel service",
            "hostel location",
            "hostel address",
            "hostel facilities",
            "hostel fees",
            "Does college provide hostel",
            "Is there any hostel",
            "Where is hostel",
            "do you have hostel",
            "do you guys have hostel",
            "hostel",
            "hostel capacity",
            "how to get in hostel",
            "what is the hostel address",
            "how far is hostel from college",
            "hostel college distance",
            "where is the hostel",
            "how big is the hostel",
            "distance between college and hostel",
            "distance between hostel and college"
         ],
         "responses": [
            "VIT AP has on-campus hostel facilities for both male and female students",
            "The hostel rooms are well-furnished and equipped with modern amenities.",
            "The hostel has a 24/7 security system to ensure the safety of students.",
            "Students can choose from different room options, including single, double, and triple occupancy.",
            "The hostel has separate blocks for different years of study.",
            "There are common areas within the hostel where students can relax and socialize.",
            "The hostel provides basic facilities such as a bed, study table, chair, cupboard, and a fan.",
            "The hostel provides laundry facilities for students.",
            "There are mess facilities within the hostel which provide food for students.",
            "The mess provides both vegetarian and non-vegetarian food options.",
            "The hostel has a gym facility for students to stay fit and healthy.",
            "The hostel has Wi-Fi connectivity to ensure students can stay connected with their studies and loved ones.",
            "The hostel has uninterrupted power supply.",
            "The hostel provides medical facilities for students in case of an emergency.",
            "The hostel has a recreation room for students to play indoor games and unwind.",
            "The hostel has a dedicated study room for students to focus on their academics.",
            "The hostel provides regular cleaning and maintenance services.",
            "The hostel has a hostel committee that takes care of the student's concerns and queries.",
            "The hostel conducts regular cultural events and activities for students to participate in.",
            "The hostel has strict rules and regulations to maintain discipline and safety on campus.",
            "Students need to adhere to specific rules regarding hostel timings, visitors, and hostel decorum.",
            "The hostel has a warden to ensure that all rules are followed and to address any issues or complaints.",
            "The hostel is within walking distance from the college. It takes around 5-10 minutes to reach there."
         ],
         "context_set": ""
      },
      {
         "tag": "event",
         "patterns": [
            "events organised",
            "list of events",
            "list of events organised in college",
            "list of events conducted in college",
            "What events are conducted in college",
            "Are there any event held at college",
            "Events?",
            "functions",
            "what are the events",
            "tell me about events",
            "what about events",
            "What kind of events do you organize?",
            "Can you tell me about the events you've organized in the past?",
            "What events are you planning to organize in the future?",
            "I'm interested in attending one of your events, can you provide more information?",
            "How many events do you organize per year?",
            "What is the biggest event you've ever organized?",
            "What kind of feedback have you received from attendees of your events?"
         ],
         "responses": [
            "There are many events organized by the college throughout the year, such as cultural festivals, sports events, technical seminars, workshops, and guest lectures. You can check with the college authorities or student council to get more information about upcoming events.",
            "The college organizes a variety of events, including cultural programs, sports tournaments, technical events, and more. You can stay updated with the college's social media pages or websites to know about upcoming events.",
            "The college hosts numerous events throughout the academic year, including cultural festivals, technical fests, sports events, and more. You can also participate in various clubs and societies to engage in more extracurricular activities."
         ],
         "context_set": ""
      },
      {
         "tag": "document",
         "patterns": [
            "document to bring",
            "documents needed for admission",
            "documents needed at the time of admission",
            "documents needed during admission",
            "documents required for admission",
            "documents required at the time of admission",
            "documents required during admission",
            "what documents do i need",
            "what documents do I need for admission",
            "documents needed",
            "What paperwork should I bring with me for my Vitap appointment?",
            "Are there any specific documents I need to bring when visiting Vitap?",
            "What identification documents do I need to bring to Vitap?",
            "Can you tell me what documents I need to bring when I come to Vitap?",
            "What documents are required for me to enter Vitap's premises?",
            "Is there a checklist of documents I need to bring when visiting Vitap?",
            "What are the essential documents for accessing Vitap's facilities?",
            "Can you give me a list of the necessary documents to bring when I visit Vitap?",
            "What documents do I need to show to gain entry to Vitap's campus?",
            "Do I need to bring any specific paperwork to access Vitap's resources?",
            "What is the required documentation for entering Vitap's premises?",
            "Are there any documents I need to prepare before visiting Vitap?",
            "What documents are necessary for me to attend an event at Vitap?",
            "Can you please provide me with a list of documents needed for visiting Vitap?",
            "What papers are required to be presented when entering Vitap's facilities?",
            "What are the mandatory documents that I need to bring for a tour of Vitap's campus?",
            "Is there a document checklist for visiting Vitap that I can reference?",
            "What documents are necessary for me to meet with a Vitap staff member?",
            "Can you please specify what documents I need to bring for a job interview at Vitap?",
            "Are there any specific documents that international visitors need to bring when visiting Vitap?"
         ],
         "responses": [
            "You will need to bring a valid photo ID and proof of registration to access Vitap's facilities.",
            "When visiting Vitap, make sure to bring your registration confirmation and a government-issued ID like a driver's license or passport.",
            "To access Vitap's campus, you will need to bring a government-issued ID and proof of registration.",
            "Be sure to bring a copy of your registration confirmation and a valid photo ID when you visit Vitap.",
            "For security purposes, you will need to bring a valid government-issued ID and proof of registration when visiting Vitap.",
            "When visiting Vitap, please have your registration confirmation and a photo ID ready to present at the entrance.",
            "To enter Vitap's facilities, you will need to present a valid government-issued ID and proof of registration.",
            "Make sure to bring a government-issued ID and proof of registration when visiting Vitap's campus.",
            "To access Vitap's premises, you will need to present a government-issued ID and proof of registration.",
            "When visiting Vitap, please bring a valid photo ID and proof of registration to gain entry.",
            "To ensure a smooth entry process, please bring your registration confirmation and a government-issued ID when visiting Vitap.",
            "To enter Vitap's campus, you will need to present a valid photo ID and proof of registration at the entrance.",
            "Make sure to bring a government-issued ID and proof of registration when visiting Vitap's facilities.",
            "When visiting Vitap, you will need to bring a government-issued ID and proof of registration to gain access.",
            "To access Vitap's premises, please bring a valid photo ID and proof of registration.",
            "When visiting Vitap, make sure to bring a government-issued ID and proof of registration to enter the campus.",
            "To enter Vitap's facilities, you will need to present a valid photo ID and proof of registration.",
            "Make sure to bring a government-issued ID and proof of registration when visiting Vitap.",
            "When visiting Vitap, please bring a valid photo ID and proof of registration to enter the premises.",
            "To access Vitap's campus, you will need to present a government-issued ID and proof of registration at the entrance."
         ],
         "context_set": ""
      },
      {
         "tag": "floors",
         "patterns": [
            "How many levels are there in the hostel building?",
            "What is the number of floors in the main academic block?",
            "How many storeys does the engineering block have?",
            "What is the height of the library building?",
            "How many floors does the management block have?",
            "What is the number of levels in the auditorium?",
            "How tall is the main building?",
            "What is the total number of floors in the hostel block?",
            "How many floors are there in the medical block?",
            "What is the height of the science block?",
            "What is the number of storeys in the research center?",
            "How many floors does the pharmacy block have?",
            "What is the height of the administrative building?",
            "How many levels are there in the computer science block?",
            "What is the total number of floors in the academic buildings?",
            "How many storeys does the architecture block have?",
            "What is the number of floors in the design block?",
            "What is the height of the hostel building?",
            "How many levels does the management building have?",
            "What is the total number of floors in the science block?"
         ],
         "responses": [
            "The hostel building has 2 floors.",
            "The main academic block has 7 floors.",
            "The engineering block has 5 storeys.",
            "The library building is 3 storeys tall.",
            "The management block has 4 floors.",
            "The auditorium has 2 levels.",
            "The main building is 5 storeys tall.",
            "The hostel block has 4 floors.",
            "The medical block has 3 floors.",
            "The science block is 6 storeys tall.",
            "The research center has 4 storeys.",
            "The pharmacy block has 3 floors.",
            "The administrative building is 4 storeys tall.",
            "The computer science block has 5 levels.",
            "The total number of floors in the academic buildings is 26.",
            "The architecture block has 4 storeys.",
            "The design block has 3 floors.",
            "The hostel building is 2 storeys tall.",
            "The management building has 4 floors.",
            "The total number of floors in the science block is 18."
         ],
         "context_set": ""
      },
      {
         "tag": "syllabus",
         "patterns": [
            "Syllabus for IT",
            "what is the Information Technology syllabus",
            "syllabus",
            "timetable",
            "what is IT syllabus",
            "syllabus",
            "What is next lecture"
         ],
         "responses": [
            "Timetable provide direct to the students OR To know about syllabus visit <a target=\"_blank\" href=\"TIMETABLE LINK\"> here</a>",
            "I'm sorry, but as an AI language model, I don't have access to the current syllabus of VIT-AP. Syllabus typically changes every year or every semester and is provided to the students by the university. I suggest you check the official website of VIT-AP or contact the university's administration for the most up-to-date information on the syllabus."
         ],
         "context_set": ""
      },
      {
         "tag": "library",
         "patterns": [
            "is there any library",
            "library facility",
            "library facilities",
            "do you have library",
            "does the college have library facility",
            "college library",
            "where can i get books",
            "book facility",
            "Where is library",
            "Library",
            "Library information",
            "Library books information",
            "Tell me about library",
            "how many libraries",
            "Is there a library available at Vitap?",
            "Can you tell me about the library facilities at Vitap?",
            "What are the opening hours for the Vitap library?",
            "How do I borrow books from the Vitap library?",
            "Is there a computer lab in the Vitap library?",
            "What kind of resources are available at the Vitap library?",
            "Can I access the Vitap library online?",
            "What is the process for reserving study rooms at the Vitap library?",
            "Are there any quiet zones in the Vitap library?",
            "Can I renew my library books online at Vitap?",
            "What is the library card policy at Vitap?",
            "What are the late fees for returning books at Vitap library?",
            "Are there any library orientation sessions offered at Vitap?",
            "Can I access online databases through the Vitap library?",
            "How many floors does the Vitap library have?",
            "Is there a special collection section at the Vitap library?",
            "What is the maximum number of books that I can borrow at a time from the Vitap library?",
            "Are there any audio-visual materials available at the Vitap library?",
            "Can I donate books to the Vitap library?",
            "What is the email address of the Vitap library for further inquiries?"
         ],
         "responses": [
            "The library facilities at Vitap are well-equipped with a wide range of resources including books, journals, newspapers, and online databases. Students can access the library's resources to enhance their learning experience.",
            "The Vitap library is open from 8am to 6pm and offers various services like borrowing books, reserving study rooms, and accessing online databases. It is a great place for students to study and learn.",
            "To borrow books from the Vitap library, students need to have a valid library card. They can check out books for a limited period and renew them online if needed.",
            "Yes, there is a computer lab available at the Vitap library for students to access. It is equipped with computers, printers, and scanners.",
            "The Vitap library has a vast collection of resources, including books, journals, newspapers, and online databases. Students can use these resources to research and enhance their learning experience.",
            "Yes, students can access the Vitap library's resources online using their login credentials. They can access online databases, e-books, and journals from anywhere, anytime.",
            "To reserve a study room at the Vitap library, students need to book it in advance through the library's online system. They can reserve the rooms for a limited period.",
            "Yes, there are designated quiet zones available at the Vitap library for students to study without any disturbances.",
            "Yes, students can renew their library books online at Vitap. They need to log in to the library's online system and follow the renewal process.",
            "To get a library card at Vitap, students need to submit their ID proof and registration confirmation at the library's circulation desk. The library card is issued to the students after verification.",
            "The late fees for returning books at Vitap library depend on the number of days the book is overdue. Students can check the library's website for more information on late fees.",
            "Yes, the Vitap library offers library orientation sessions to help students understand the library's rules",
            "There is one huge and spacious library.timings are 8am to 6pm and for more visit <a target=\"blank\" href=\"ADD LIBRARY DETAIL LINK\">here</a>"
         ],
         "context_set": ""
      },
      {
         "tag": "infrastructure",
         "patterns": [
            "how is college infrastructure",
            "infrastructure",
            "college infrastructure",
            "How is the infrastructure at VITAP?",
            "What kind of infrastructure does VITAP have?",
            "Tell me about the facilities at VITAP",
            "Are the classrooms at VITAP well-equipped?",
            "What is the quality of the sports facilities at VITAP?",
            "What kind of labs does VITAP have?",
            "How accessible is the VITAP campus?",
            "Is there ample parking space at VITAP?",
            "What is the internet speed like at VITAP?",
            "Can you describe the libraries at VITAP?",
            "Does VITAP have modern classrooms?",
            "Tell me about the research facilities at VITAP.",
            "What is the quality of the cafeteria at VITAP?",
            "What kind of auditoriums does VITAP have?",
            "Are there any medical facilities available on campus at VITAP?",
            "Tell me about the hostel facilities at VITAP.",
            "What is the quality of the transportation facilities at VITAP?",
            "Does VITAP have a well-stocked bookstore?",
            "Are there any recreational facilities available on campus at VITAP?",
            "How is the overall environment and ambience of the VITAP campus?"
         ],
         "responses": [
            "Our University has Excellent Infrastructure. Campus is clean. Good IT Labs With Good Speed of Internet connection. There are also modern and well-equipped classrooms, libraries, and sports facilities available for the students. The campus is also accessible and has ample parking space for students and staff.",
            "VITAP has excellent infrastructure. The campus is clean and well-maintained.",
            "VITAP offers modern and well-equipped facilities for its students. There are spacious classrooms, well-stocked libraries, and state-of-the-art sports facilities available.",
            "The labs at VITAP are of high-quality and well-maintained, with good internet speed and connectivity.",
            "The classrooms at VITAP are modern and well-equipped with all necessary facilities.",
            "The sports facilities at VITAP are top-notch, with access to multiple indoor and outdoor sports facilities.",
            "VITAP offers advanced labs with all modern equipment necessary for research and development.",
            "The VITAP campus is easily accessible with good transportation facilities and ample parking space for students and staff.",
            "VITAP offers ample parking space for students and staff.",
            "The internet speed and connectivity at VITAP are of high quality and provide seamless access to the internet.",
            "The libraries at VITAP are well-stocked with books and journals related to various fields.",
            "VITAP has modern classrooms with all necessary facilities, including projectors, whiteboards, and good seating arrangements.",
            "VITAP has state-of-the-art research facilities that provide students with the necessary resources for conducting research.",
            "The cafeteria at VITAP offers good quality food with a variety of options to choose from.",
            "VITAP has spacious and well-equipped auditoriums for conducting various events and activities.",
            "VITAP offers medical facilities on campus with trained medical staff available round the clock.",
            "The hostel facilities at VITAP are of high quality, providing comfortable living arrangements for students.",
            "The transportation facilities at VITAP are good with buses available to commute to and from the campus.",
            "The bookstore at VITAP is well-stocked with books and study material for students.",
            "There are various recreational facilities available on the VITAP campus, including indoor games, outdoor sports, and other activities.",
            "The overall environment and ambience of the VITAP campus are positive and conducive to learning and growth."
         ],
         "context_set": ""
      },
      {
         "tag": "canteen",
         "patterns": [
            "food facilities",
            "canteen facilities",
            "canteen facility",
            "is there any canteen",
            "Is there a cafetaria in college",
            "Does college have canteen",
            "Where is canteen",
            "where is cafetaria",
            "canteen",
            "Food",
            "Cafetaria",
            "What are the food options available at the canteen in VITAP?",
            "Is the canteen at VITAP open on weekends?",
            "Can we pay for food at the VITAP canteen with credit or debit card?",
            "What are the operating hours of the canteen at VITAP?",
            "Is there a separate canteen for boys and girls at VITAP?",
            "Does VITAP canteen offer any special meals or deals for students?",
            "What is the price range of the food items at the VITAP canteen?",
            "Is there a seating area available at the VITAP canteen?",
            "What is the quality of the food served at the VITAP canteen?",
            "Are there any restrictions on outside food in the VITAP campus?",
            "What is the location of the VITAP canteen?",
            "Does the VITAP canteen serve any international cuisine?",
            "Are there any vending machines available in the VITAP canteen?",
            "What are the hygiene measures taken by the VITAP canteen?",
            "Is there a feedback mechanism for the VITAP canteen?",
            "Are there any food festivals or events organized by the VITAP canteen?",
            "Does the VITAP canteen offer any discounts for faculty and staff?",
            "What are the payment options available at the VITAP canteen?",
            "Does the VITAP canteen have a mobile app for ordering food?",
            "Are there any vegetarian-only options available at the VITAP canteen?"
         ],
         "responses": [
            "Our university has canteen with variety of food available",
            "Our university has a canteen with a variety of food available. The canteen serves both vegetarian and non-vegetarian food. It also offers snacks, drinks, and desserts at affordable prices. The canteen is located in the central area of the campus, making it easily accessible to students and staff. The canteen also maintains a high level of cleanliness and hygiene to ensure the health and safety of its customers.",
            "The VITAP canteen offers a wide range of food options including Indian, Chinese, and continental cuisine.",
            "Yes, the VITAP canteen is open on weekends with adjusted timings.",
            "Yes, you can pay for food at the VITAP canteen using your credit or debit card.",
            "The operating hours of the VITAP canteen are from 8:00 AM to 7:00 PM on weekdays and from 9:00 AM to 5:00 PM on weekends.",
            "No, there is no separate canteen for boys and girls at VITAP. Both boys and girls can access the same canteen.",
            "Yes, the VITAP canteen offers special meals and deals for students on occasion.",
            "The food items at the VITAP canteen are priced reasonably, with items ranging from INR 20 to INR 200.",
            "Yes, there is a seating area available at the VITAP canteen where students can sit and eat.",
            "The food served at the VITAP canteen is of high quality, with strict hygiene standards in place.",
            "Yes, there are restrictions on outside food in the VITAP campus. Students are not allowed to bring food from outside the campus.",
            "The VITAP canteen is located near the academic block of the campus, making it easily accessible to students and staff.",
            "Yes, the VITAP canteen serves some international cuisine, including Chinese and Italian dishes.",
            "Yes, there are vending machines available at the VITAP canteen.",
            "The VITAP canteen maintains a high level of cleanliness and hygiene, with regular cleaning and sanitization."
         ],
         "context_set": ""
      },
      {
         "tag": "menu",
         "patterns": [
            "food menu",
            "food in canteen",
            "Whats there on menu",
            "what is available in college canteen",
            "what foods can we get in college canteen",
            "food variety",
            "What is there to eat?",
            "What are the food options in the canteen at Vitap?",
            "Can you tell me what food is available in the college canteen?",
            "What kind of food is served in the canteen at Vitap?",
            "I'm hungry. What food is there to eat at Vitap?",
            "What is on the menu for breakfast, lunch and dinner at Vitap?",
            "What are the meal options in the canteen at Vitap?",
            "Can you give me some information about the food served in the canteen at Vitap?",
            "What kind of snacks and beverages are available in the canteen at Vitap?",
            "Is there a vegetarian food option in the college canteen?",
            "What are the popular food items in the canteen at Vitap?",
            "Do they serve Chinese food in the canteen at Vitap?",
            "What is the cost of food items in the canteen at Vitap?",
            "What are the timings of the canteen at Vitap?",
            "Are there any special food items served during festivals or events at Vitap?",
            "Can you give me a detailed list of food items on the menu at Vitap?",
            "Is there a separate section for bakery items in the canteen at Vitap?",
            "What is the most recommended food item in the canteen at Vitap?",
            "Can you tell me about any food combos or meal deals in the canteen at Vitap?",
            "What is the seating capacity of the canteen at Vitap?",
            "Are there any restrictions on the number of times we can eat in the canteen at Vitap?"
         ],
         "responses": [
            "We serve a variety of food items including Franky, Locho, Alu-puri, Kachori, Khavsa, Thaali and many more.",
            "You can find a range of delicious food options in the college canteen at Vitap.",
            "Our canteen offers a diverse menu that caters to different tastes and preferences.",
            "Our canteen serves a variety of dishes for breakfast, lunch and dinner.",
            "You can choose from a wide range of meal options in the canteen at Vitap.",
            "We have a selection of snacks, beverages and meals available in the college canteen at Vitap.",
            "Our canteen has a separate vegetarian food section to cater to vegetarian students.",
            "The canteen at Vitap offers affordable food items that are value for money.",
            "The canteen at Vitap is open from 7:30 AM to 7:30 PM on weekdays.",
            "We have special food items that are served during festivals and events to celebrate the occasion.",
            "Our canteen offers a range of Chinese food options for students who enjoy Chinese cuisine.",
            "The cost of food items in the canteen at Vitap is very reasonable.",
            "The timings of the canteen at Vitap are convenient and suitable for students.",
            "We have a seating capacity of over 200 students in the canteen at Vitap.",
            "We have a separate section for bakery items in the college canteen at Vitap.",
            "Our most recommended food item is the Franky, which is a popular snack among students.",
            "We offer meal deals and combos that provide great value for money.",
            "The canteen at Vitap can accommodate up to 250 students at a time.",
            "There are no restrictions on the number of times you can eat in the canteen"
         ],
         "context_set": ""
      },
      {
         "tag": "placement",
         "patterns": [
            "What is college placement",
            "Which companies visit in college",
            "What is average package",
            "companies visit",
            "package",
            "About placement",
            "placement",
            "recruitment",
            "companies",
            "What is the placement record of Vitap?",
            "Which companies visit Vitap for recruitment?",
            "What is the average package offered during placements at Vitap?",
            "Can you tell me about the placement process at Vitap?",
            "How does Vitap ensure good placements for its students?",
            "What kind of job roles are offered to Vitap students during campus placements?",
            "What is the eligibility criteria for participating in Vitap's campus placements?",
            "What is the success rate of Vitap students in securing job offers during campus placements?",
            "What kind of training and preparation is provided to Vitap students for campus placements?",
            "What is the role of Vitap's placement cell in facilitating campus placements?",
            "How can I register for Vitap's campus placement program?",
            "Can you provide me with a list of past recruiters at Vitap?",
            "What is the reputation of Vitap's placement cell in the industry?",
            "What kind of support does Vitap provide to students after they are placed?",
            "What are the key skills that Vitap students are trained on for campus placements?",
            "What is the process for companies to register for campus placements at Vitap?",
            "Can students from other colleges participate in Vitap's campus placement program?",
            "What is the timeline for campus placements at Vitap?",
            "What is the placement policy of Vitap?"
         ],
         "responses": [
            "Vitap has a good placement record. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>.",
            "Several reputed companies visit Vitap for recruitment. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "The average package offered during placements at Vitap is competitive. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "The placement process at Vitap involves several stages such as aptitude tests, group discussions, and interviews. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "Vitap ensures good placements for its students by providing them with quality education and training, as well as by inviting reputed companies for campus placements. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "During campus placements, Vitap students are offered job roles in various domains such as IT, finance, marketing, and operations. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "The eligibility criteria for participating in Vitap's campus placements varies based on the company's requirements. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "Vitap students have a high success rate in securing job offers during campus placements. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>",
            "Vitap provides extensive training and preparation to its students for campus placements, including mock interviews, resume building, and soft skills training. To know more, visit <a target=\"_blank\" href=\"https: //vitap.ac.in/placement/career-development-centre/\">here</a>"
         ],
         "context_set": ""
      },
      {
         "tag": "dataScienceHOD",
         "patterns": [
            "Who is the Head of the Data Science department?",
            "What is the name of the Data Science department's HOD?",
            "Can you tell me who the HOD of the Data Science department is?",
            "Where can I find the HOD of the Data Science department?",
            "What is the contact information for the HOD of the Data Science department?",
            "Who is the current HOD of the Data Science department at Vitap?",
            "Can you provide me with the name of the HOD of the Data Science department?",
            "Where is the office of the HOD of the Data Science department located?",
            "Who is responsible for overseeing the Data Science department?",
            "Who is the person in charge of the Data Science department?",
            "What is the name of the head of the Data Science department?",
            "Where can I find the HOD of the Data Science department at Vitap?",
            "Who can I contact to speak with the HOD of the Data Science department?",
            "Is there a specific person who serves as the HOD of the Data Science department?",
            "What are the responsibilities of the HOD of the Data Science department?",
            "Who should I contact if I have questions for the HOD of the Data Science department?",
            "Can you tell me more about the HOD of the Data Science department?",
            "What is the role of the HOD in the Data Science department?",
            "Who oversees the Data Science department at Vitap?",
            "Who is the head of the Data Science department responsible to?"
         ],
         "responses": [
            "The Head of the Data Science department is Professor XYZ, and their office is located in (Place name) at Vitap.",
            "Professor XYZ is the current HOD of the Data Science department at Vitap, and their office is located in (Place name).",
            "If you need to speak with the HOD of the Data Science department, you can contact Professor XYZ, whose office is located in (Place name) at Vitap.",
            "The HOD of the Data Science department is responsible for overseeing the academic programs and research initiatives in the department. Professor XYZ currently holds this position and can be found in their office located in (Place name) at Vitap.",
            "If you have any questions or concerns related to the Data Science department, you can contact the HOD, Professor XYZ, whose office is located in (Place name) at Vitap.",
            "Professor XYZ is the designated HOD for the Data Science department at Vitap, and they can be reached at their office located in (Place name).",
            "The HOD of the Data Science department is responsible for managing and coordinating the department's academic and research activities. Professor XYZ is the current HOD and can be found in their office located in (Place name) at Vitap.",
            "If you need to meet with the HOD of the Data Science department, you can schedule an appointment with Professor XYZ, whose office is located in (Place name) at Vitap.",
            "The HOD of the Data Science department is Professor XYZ, who can be reached at their office located in (Place name) at Vitap.",
            "Professor XYZ is the Head of the Data Science department at Vitap, and their office is located in (Place name).",
            "If you have any questions or concerns regarding the Data Science department, you can contact the HOD, Professor XYZ, at their office located in (Place name) at Vitap.",
            "The HOD of the Data Science department is responsible for overseeing the academic and research programs within the department. Professor XYZ is the current HOD and can"
         ],
         "context_set": ""
      },
      {
         "tag": "computerhod",
         "patterns": [
            "Who is computer HOD",
            "Where is computer HOD",
            "computer hod",
            "name of computer hod",
            "Who is the head of the Computer Department at Vitap?",
            "Where can I find the Computer Department head?",
            "What is the name of the Computer Department's head?",
            "Who is in charge of the Computer Department at Vitap?",
            "Can you tell me the name of the Computer Department head?",
            "Where is the Computer Department head located?",
            "Who holds the position of Computer Department head at Vitap?",
            "What is the Computer Department head's name?",
            "Who oversees the Computer Department at Vitap?",
            "Where can I find the Computer Department head's office?",
            "What is the name of the person who leads the Computer Department at Vitap?",
            "Who manages the Computer Department at Vitap?",
            "What is the Computer Department head's contact information?",
            "Who is responsible for the Computer Department at Vitap?",
            "What is the Computer Department head's role at Vitap?",
            "Who is the current head of the Computer Department at Vitap?",
            "Where can I meet the head of the Computer Department at Vitap?",
            "Who can I speak to about the Computer Department at Vitap?",
            "Who can answer questions about the Computer Department at Vitap?",
            "What is the name of the person in charge of the Computer Department at Vitap?"
         ],
         "responses": [
            "The head of the Computer Department at Vitap is XYZ, who can be found at (PLACE NAME).",
            "The head of the Computer Department at Vitap is responsible for overseeing the department's activities and can be located at (PLACE NAME).",
            "XYZ is the current head of the Computer Department at Vitap and can be reached at (CONTACT INFORMATION).",
            "The person who leads the Computer Department at Vitap is XYZ, and their office is located at (PLACE NAME).",
            "XYZ is the Computer Department head at Vitap and is responsible for managing the department's operations.",
            "The Computer Department head at Vitap is XYZ, and they can be contacted at (CONTACT INFORMATION).",
            "If you need to speak with the head of the Computer Department at Vitap, you can find them at (PLACE NAME).",
            "The current head of the Computer Department at Vitap is XYZ, and their role involves managing the department's affairs.",
            "XYZ is the person in charge of the Computer Department at Vitap and is available at (CONTACT INFORMATION).",
            "If you have questions about the Computer Department at Vitap, you can speak with XYZ, the department head.",
            "The head of the Computer Department at Vitap is XYZ, who holds responsibility for overseeing the department's functions.",
            "XYZ is the current Computer Department head at Vitap and is located at (PLACE NAME).",
            "The person who manages the Computer Department at Vitap is XYZ, and they can be reached at (CONTACT INFORMATION).",
            "If you need to reach the head of the Computer Department at Vitap, you can contact XYZ at (CONTACT INFORMATION).",
            "XYZ is responsible for the Computer Department at Vitap and is available at (CONTACT INFORMATION).",
            "The head of the Computer Department at Vitap is XYZ, and they are responsible for leading the department's efforts.",
            "If you are looking for information about the Computer Department at Vitap, you can contact XYZ, the department head.",
            "The Computer Department at Vitap is overseen by XYZ, who can be found at (PLACE NAME).",
            "XYZ is the current head of the Computer Department at Vitap and can be contacted at (CONTACT INFORMATION).",
            "The person who is in charge of the"
         ],
         "context_set": ""
      },
      {
         "tag": "extchod",
         "patterns": [
            "Who is extc HOD",
            "Where is  extc HOD",
            "extc hod",
            "name of extc hod",
            "Who is the Head of Department for Electronics and Telecommunication Engineering?",
            "Who is in charge of the Electronics and Telecommunication Engineering Department?",
            "Can you tell me the name of the HOD for the ETC Department?",
            "Who is currently leading the Electronics and Telecommunication Engineering Department at Vitap?",
            "Where can I find information about the Head of Department for ETC?",
            "What is the name of the HOD for the Electronics and Telecommunication Engineering Department?",
            "Who is the current HOD for ETC?",
            "Can you provide me with the name of the HOD for Electronics and Telecommunication Engineering Department at Vitap?",
            "What is the name of the person who heads the ETC Department?",
            "Who is responsible for the Electronics and Telecommunication Engineering Department at Vitap?",
            "Where can I find information about the HOD for ETC?",
            "Can you tell me who is leading the Electronics and Telecommunication Engineering Department at Vitap?",
            "Who is the head of the ETC Department at Vitap?",
            "Can you give me the name of the person in charge of the Electronics and Telecommunication Engineering Department?",
            "Who is the leader of the Electronics and Telecommunication Engineering Department at Vitap?",
            "Who is the HOD for ETC at Vitap?",
            "Can you provide me with the name of the current Head of Department for Electronics and Telecommunication Engineering at Vitap?",
            "What is the name of the person who is in charge of the ETC Department at Vitap?",
            "Who is responsible for the ETC Department at Vitap?",
            "Can you tell me the name of the HOD for the Electronics and Telecommunication Engineering Department at Vitap?"
         ],
         "responses": [
            "Different school wise hod are different.So be more clear with your school or department",
            "The Head of Department for Electronics and Telecommunication Engineering varies according to each school and department at Vitap. Could you please provide more information?",
            "The name of the Head of Department for Electronics and Telecommunication Engineering at Vitap may vary depending on the specific school or department. Can you please specify?",
            "At Vitap, the Head of Department for Electronics and Telecommunication Engineering may vary depending on the school or department. Could you please provide more information?",
            "The Head of Department for Electronics and Telecommunication Engineering at Vitap varies based on the school or department. Could you please provide more specific details?",
            "The person in charge of the Electronics and Telecommunication Engineering Department at Vitap may vary depending on the specific school or department. Can you please specify?",
            "The HOD for Electronics and Telecommunication Engineering Department at Vitap varies depending on the specific school or department. Could you please provide more details?",
            "At Vitap, the Head of Department for Electronics and Telecommunication Engineering may vary depending on the school or department. Can you please provide more specific details?",
            "The Head of Department for Electronics and Telecommunication Engineering varies depending on the specific school or department at Vitap. Can you please provide more information?",
            "The person in charge of the ETC Department at Vitap may vary depending on the specific school or department. Can you please specify?",
            "The HOD for the ETC Department at Vitap varies depending on the specific school or department. Can you please provide more details?",
            "At Vitap, the person responsible for the Electronics and Telecommunication Engineering Department may vary depending on the school or department. Could you please provide more information?",
            "The name of the person leading the Electronics and Telecommunication Engineering Department at Vitap may vary depending on the specific school or department. Can you please specify?"
         ],
         "context_set": ""
      },
      {
         "tag": "principal",
         "patterns": [
            "what is the name of principal",
            "whatv is the principal name",
            "principal name",
            "Who is college principal",
            "Where is principal's office",
            "principal",
            "name of principal",
            "What is the name of the principal of Vitap?",
            "Who is the current principal of Vitap?",
            "Can you tell me the name of Vitap's principal?",
            "Who leads Vitap as the principal?",
            "Where can I find the principal's office at Vitap?",
            "What are the contact details for Vitap's principal?",
            "What is the role of the principal at Vitap?",
            "How long has the current principal been at Vitap?",
            "What is the background of Vitap's principal?",
            "Who was the previous principal of Vitap?",
            "What is the principal's vision for Vitap's future?",
            "How is the principal involved in the day-to-day operations of Vitap?",
            "What is the principal's approach to leadership at Vitap?",
            "What is the principal's educational background and experience?",
            "Can students meet with the principal at Vitap?",
            "What is the principal's stance on student engagement and involvement?",
            "How does the principal work with the faculty and staff at Vitap?",
            "What is the principal's strategy for promoting student success at Vitap?",
            "How has the principal contributed to the growth and development of Vitap?",
            "What initiatives has the principal implemented at Vitap?"
         ],
         "responses": [
            "XYZ is college principal and if you need any help then call your branch hod first.That is more appropriate",
            "The current principal of Vitap is Dr. X",
            "Dr. X is the principal of Vitap",
            "The name of Vitap's principal is Dr. X",
            "Dr. X leads Vitap as the principal",
            "The principal's office is located at X location on Vitap's campus",
            "You can contact the principal at X email or phone number",
            "The principal is responsible for overseeing all aspects of Vitap's academic and administrative operations",
            "The current principal has been at Vitap for X years",
            "The principal has a background in X and has previously worked at X",
            "The previous principal of Vitap was Dr. Y",
            "The principal's vision for Vitap's future is X",
            "The principal is involved in decision-making and strategic planning for Vitap",
            "The principal values open communication and collaboration with all members of the Vitap community",
            "The principal holds a Ph.D. in X and has extensive experience in X",
            "Students can schedule a meeting with the principal through the office of X",
            "The principal is committed to promoting student engagement and involvement in extracurricular activities",
            "The principal works closely with the faculty and staff to ensure a positive learning environment for students",
            "The principal's strategy for promoting student success includes X, Y, and Z",
            "The principal has overseen the implementation of X, Y, and Z initiatives at Vitap",
            "Under the leadership of the principal, Vitap has seen significant growth and development in X area"
         ],
         "context_set": ""
      },
      {
         "tag": "sem",
         "patterns": [
            "exam dates",
            "exam schedule",
            "When is semester exam",
            "Semester exam timetable",
            "sem",
            "semester",
            "exam",
            "when is exam",
            "exam timetable",
            "exam dates",
            "when is semester",
            "What is the schedule for the upcoming semester exams?",
            "Can you provide me with the timetable for this semester's exams?",
            "When will the semester exams start?",
            "I need to know the dates for the semester exams.",
            "Is there a specific date for the semester exams?",
            "When can we expect the schedule for the semester exams?",
            "Can you give me details about the semester exam schedule?",
            "How can I access the semester exam timetable?",
            "When will the semester exam timetable be released?",
            "Is there a deadline to register for the semester exams?",
            "What is the last date to apply for the semester exams?",
            "I missed the semester exam registration deadline, can I still apply?",
            "What is the duration of each semester exam?",
            "Can I use a calculator during the semester exams?",
            "Are there any restrictions on what I can bring to the semester exams?",
            "Is attendance mandatory for the semester exams?",
            "What happens if I miss one of the semester exams?",
            "How will I receive my semester exam results?",
            "Is there a way to apply for revaluation of semester exam papers?",
            "What is the procedure for applying for revaluation of semester exam papers?"
         ],
         "responses": [
            "Here is the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDER\">website</a>",
            "You can find the schedule for the semester exams on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The semester exam timetable can be accessed on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The semester exams are expected to start on the dates mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "You can find the dates for the semester exams on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The semester exams will take place as per the schedule mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The semester exam schedule will be released on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "You can access the semester exam timetable on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The semester exam timetable will be released on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The last date to register for the semester exams is mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "The deadline to apply for the semester exams is mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "Late applications for the semester exams will not be considered.",
            "The duration of each semester exam is mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>.",
            "Use of calculators during the semester exams is subject to the rules and regulations mentioned on the Academic Calendar  <a target=\"_blank\" href=\"YOUR ACADEMIC CALENDAR\">website</a>"
         ],
         "context_set": ""
      },
      {
         "tag": "admission",
         "patterns": [
            "what is the process of admission",
            "what is the admission process",
            "How to take admission in your college",
            "What is the process for admission",
            "admission",
            "admission process",
            "What is the admission process for Vitap?",
            "How can I apply for admission to Vitap?",
            "What are the requirements for admission to Vitap?",
            "What is the eligibility criteria for admission to Vitap?",
            "Can you tell me more about Vitap's admission process?",
            "I am interested in applying to Vitap. What do I need to do?",
            "What is the application process for Vitap?",
            "How do I get admission to Vitap?",
            "What documents do I need to submit for admission to Vitap?",
            "What is the last date for admission to Vitap?",
            "Is there an entrance exam for admission to Vitap?",
            "What is the minimum eligibility criteria for admission to Vitap?",
            "What is the selection process for admission to Vitap?",
            "Can I get admission to Vitap through management quota?",
            "What is the fee structure for admission to Vitap?",
            "Can I apply for multiple courses during the admission process at Vitap?",
            "Is there a scholarship available for students seeking admission to Vitap?",
            "What is the duration of the admission process at Vitap?",
            "What is the procedure for cancellation of admission at Vitap?",
            "Can I get a refund if I cancel my admission at Vitap?"
         ],
         "responses": [
            "Application can also be submitted online through the Unversity's  <a target=\"_blank\" href=\"LINK OF ADMISSION DOCUMENT\">website</a>",
            "Application can be submitted online through the University's website.",
            "To apply for admission to Vitap, you need to fill out the online application form available on the University's website.",
            "The eligibility criteria for admission to Vitap varies depending on the program you are applying for. Please visit the University's website for more information.",
            "The admission process for Vitap usually involves filling out an online application form, submitting required documents, and appearing for an entrance exam or interview.",
            "The last date for admission to Vitap varies depending on the program you are applying for. Please visit the University's website for more information.",
            "The fee structure for admission to Vitap varies depending on the program you are applying for. Please visit the University's website for more information.",
            "Yes, there is a scholarship available for students seeking admission to Vitap. Please visit the University's website for more information.",
            "The duration of the admission process at Vitap depends on the program you are applying for and may vary.",
            "To cancel your admission at Vitap, you need to submit a written request to the University's admission office.",
            "If you cancel your admission at Vitap before a certain date, you may be eligible for a refund. Please visit the University's website for more information.",
            "To get admission to Vitap, you need to fulfill the eligibility criteria, fill out the application form, and submit required documents.",
            "The selection process for admission to Vitap varies depending on the program you are applying for and may involve an entrance exam or interview.",
            "Yes, you can apply for multiple courses during the admission process at Vitap. Please visit the University's website for more information.",
            "You can get admission to Vitap through the management quota, but the number of seats available through this quota is limited.",
            "The procedure for cancellation of admission at Vitap involves submitting a written request to the University's admission office and may involve some penalties.",
            "The admission process for Vitap usually starts in the month of May and continues until the end of July.",
            "To apply for admission to Vitap, you need to submit the required documents along with the application form."
         ],
         "context_set": ""
      },
      {
         "tag": "scholarship",
         "patterns": [
            "What are the available scholarships at Vitap?",
            "Can you provide information about scholarships at Vitap?",
            "Are there any scholarships for AI/ML students at Vitap?",
            "How can I apply for a scholarship at Vitap?",
            "What are the eligibility criteria for scholarships at Vitap?",
            "Can I get a scholarship for computer engineering at Vitap?",
            "Is there any scholarship available for IT engineering students at Vitap?",
            "Are there any scholarships for mechanical engineering students at Vitap?",
            "What kind of scholarships are available for civil engineering students at Vitap?",
            "Can I apply for a chemical engineering scholarship at Vitap?",
            "Where can I find a list of scholarships available at Vitap?",
            "What is the process for applying for a scholarship at Vitap?",
            "Are there any scholarships specifically for first-year students at Vitap?",
            "What are the scholarships available for second-year students at Vitap?",
            "Are there any scholarships available for third-year students at Vitap?",
            "What kind of scholarships are available for fourth-year students at Vitap?",
            "Is there an automobile scholarship available at Vitap?",
            "Can you provide information about the scholarship for computer engineering students at Vitap?",
            "What is the scholarship amount for IT engineering students at Vitap?",
            "How can I get more information about mechanical engineering scholarships at Vitap?"
         ],
         "responses": [
            "Vitap provides several government scholarships to students who are eligible. For more information and updates, please visit our website.",
            "We offer various scholarships for students based on their merit, financial background, and academic achievements. Please visit our website for more details.",
            "There are scholarships available for AI/ML students at Vitap. Please visit our website for more information.",
            "To apply for a scholarship at Vitap, students must meet the eligibility criteria and submit the required documents. Please visit our website for more information.",
            "The eligibility criteria for scholarships at Vitap vary depending on the scholarship program. Please visit our website for more information.",
            "Yes, you can apply for a scholarship for computer engineering at Vitap. Please visit our website for more details.",
            "Yes, there are scholarships available for IT engineering students at Vitap. Please visit our website for more information.",
            "There are scholarships available for mechanical engineering students at Vitap. Please visit our website for more details.",
            "Various scholarships are available for civil engineering students at Vitap, including those based on merit and financial background. Please visit our website for more information.",
            "Yes, you can apply for a chemical engineering scholarship at Vitap. Please visit our website for more information.",
            "You can find a list of available scholarships at Vitap on our website.",
            "To apply for a scholarship at Vitap, please visit our website and follow the instructions provided.",
            "Yes, there are scholarships specifically for first-year students at Vitap. Please visit our website for more details.",
            "Several scholarships are available for second-year students at Vitap. Please visit our website for more information.",
            "There are scholarships available for third-year students at Vitap. Please visit our website for more details.",
            "Various scholarships are available for fourth-year students at Vitap, including those based on merit and financial background. Please visit our website for more information.",
            "There is no automobile scholarship available at Vitap at this time.",
            "For more information about scholarships for computer engineering students at Vitap, please visit our website."
         ],
         "context_set": ""
      },
      {
         "tag": "facilities",
         "patterns": [
            "What facilities college provide",
            "College facility",
            "What are college facilities",
            "facilities",
            "facilities provided",
            "What are the facilities available in Vitap?",
            "Can you tell me about the facilities at Vitap?",
            "What kind of facilities does Vitap offer?",
            "What facilities are provided at Vitap?",
            "What are the amenities available at Vitap?",
            "Tell me about the infrastructure and facilities at Vitap.",
            "Are there any sports facilities available at Vitap?",
            "What are the research facilities available at Vitap?",
            "What facilities does Vitap offer for extracurricular activities?",
            "Can you give me an overview of the facilities at Vitap?",
            "Does Vitap have a gym facility for students?",
            "What are the medical facilities available at Vitap?",
            "Are there any hostel facilities provided at Vitap?",
            "Can you tell me about the transportation facilities at Vitap?",
            "What facilities are provided for students with disabilities at Vitap?",
            "What kind of library facilities does Vitap offer?",
            "What are the computing facilities available at Vitap?",
            "Does Vitap have any recreational facilities for students?",
            "What kind of lab facilities are available at Vitap?",
            "Can you tell me about the food facilities at Vitap?"
         ],
         "responses": [
            "Our university's Engineering department provides fully AC Lab with internet connection, smart classroom, Auditorium, library,canteen",
            "Vitap provides various facilities such as fully AC Lab with internet connection, smart classroom, Auditorium, library, canteen, sports facilities, hostel facilities, medical facilities, transportation facilities, and recreational facilities for students.",
            "Our campus offers state-of-the-art facilities including smart classrooms, library, computer labs, sports facilities, recreational facilities, medical facilities, and transportation facilities.",
            "Vitap provides a wide range of facilities to its students including fully equipped labs, library, sports facilities, recreational facilities, medical facilities, transportation facilities, and more.",
            "At Vitap, students have access to a range of facilities such as library, sports facilities, medical facilities, transportation facilities, and more.",
            "Our university offers numerous facilities including smart classrooms, computer labs, library, sports facilities, medical facilities, transportation facilities, and more to cater to the needs of our students.",
            "Vitap provides excellent facilities to its students such as fully AC Lab with internet connection, smart classroom, Auditorium, library, canteen, sports facilities, hostel facilities, medical facilities, transportation facilities, and recreational facilities.",
            "At Vitap, we believe that providing the right facilities is crucial for the development of our students, and that's why we offer a wide range of facilities including library, sports facilities, medical facilities, transportation facilities, and more.",
            "We offer a range of facilities at Vitap including smart classrooms, library, sports facilities, medical facilities, transportation facilities, and more to help our students achieve their academic goals.",
            "Our university has invested in various facilities including fully equipped labs, library, sports facilities, medical facilities, transportation facilities, and more to ensure that our students have access to the best resources.",
            "Vitap provides an array of facilities including fully AC Lab with internet connection, smart classroom, Auditorium, library, canteen, sports facilities, hostel facilities, medical facilities, transportation facilities, and recreational facilities to create a conducive learning environment for students.",
            "At Vitap, we understand that facilities play an important role in creating a supportive learning environment, and that's why we offer various facilities such as library, sports facilities, medical facilities, transportation facilities, and more.",
            "Our university provides a range of facilities to cater to the needs of our students including smart classrooms, computer labs, library, sports facilities, medical facilities, transportation facilities, and more."
         ],
         "context_set": ""
      },
      {
         "tag": "college intake",
         "patterns": [
            "max number of students",
            "number of seats per branch",
            "number of seats in each branch",
            "maximum number of seats",
            "maximum students intake",
            "What is college intake",
            "how many student are taken in each branch",
            "seat allotment",
            "seats",
            "What is the total number of seats available at Vitap?",
            "How many students are admitted to Vitap each year?",
            "Can you tell me about the student intake process at Vitap?",
            "What is the intake capacity of Vitap?",
            "What is the maximum number of students that Vitap can accommodate?",
            "How many seats are available in each branch at Vitap?",
            "What is the intake capacity for the engineering program at Vitap?",
            "How are seats allotted at Vitap?",
            "What is the process for seat allotment at Vitap?",
            "What is the student intake policy at Vitap?",
            "What is the maximum number of seats available for the computer science program at Vitap?"
         ],
         "responses": [
            "The total number of seats available at Vitap varies by program. Please check the program brochure for more information.",
            "The number of seats in each branch at Vitap may vary by program. Please refer to the program brochure for details.",
            "The number of seats in each branch at Vitap varies by program. Please refer to the program brochure for more information.",
            "The maximum number of seats available at Vitap varies by program. Please check the program brochure for details.",
            "The maximum student intake at Vitap may vary by program. Please refer to the program brochure for more information.",
            "College intake refers to the number of students that are admitted to a college or university each year.",
            "The number of students admitted to each branch at Vitap may vary by program. Please refer to the program brochure for more information.",
            "Seat allotment at Vitap is done based on the merit of the student and the availability of seats.",
            "The number of seats available at Vitap varies by program. Please refer to the program brochure for more information.",
            "Each year, Vitap admits a certain number of students to its various programs. Please refer to the program brochure for details.",
            "The student intake process at Vitap may vary by program. Please refer to the program brochure for more information.",
            "The intake capacity of Vitap varies by program. Please refer to the program brochure for details.",
            "The maximum number of students that Vitap can accommodate varies by program. Please check the program brochure for more information.",
            "The number of seats available in each branch at Vitap may vary by program. Please refer to the program brochure for details.",
            "The intake capacity for the engineering program at Vitap may vary each year. Please check the program brochure for more information.",
            "Seats at Vitap are allotted based on the merit of the student and the availability of seats.",
            "The process for seat allotment at Vitap may vary by program. Please refer to the program brochure for details.",
            "The student intake policy at Vitap may vary by program. Please refer to the program brochure for more information.",
            "The maximum number of seats available for the computer science program at Vitap may vary each year. Please check the program brochure for details."
         ],
         "context_set": ""
      },
      {
         "tag": "uniform",
         "patterns": [
            "college dress code",
            "college dresscode",
            "what is the uniform",
            "can we wear casuals",
            "Does college have an uniform",
            "Is there any uniform",
            "uniform",
            "what about uniform",
            "do we have to wear uniform"
         ],
         "responses": [
            "There is no uniform or dresscode",
            "There are no specific requirements for uniforms or dress codes at this institution.",
            "The college does not have a uniform or dress code policy",
            "Students are not obligated to adhere to a dress code or wear a uniform while on campus.",
            "At this college, there are no set guidelines for uniforms or dress codes.",
            "Dress codes and uniforms are not required at this educational institution.",
            "This institution does not enforce any uniform or dress code policies.",
            "Students are free to dress as they choose at this college, as there is no dress code or uniform requirement.",
            "There are no regulations regarding uniforms or dress codes at this academic institution.",
            "At this institution, students are not mandated to follow a specific dress code or wear a uniform.",
            "This college has a relaxed policy on dress codes and uniforms, and students are not required to adhere to any specific guidelines."
         ],
         "context_set": ""
      },
      {
         "tag": "committee",
         "patterns": [
            "what are the different committe in college",
            "different committee in college",
            "Are there any committee in college",
            "Give me committee details",
            "committee",
            "how many committee are there in college",
            "What are the responsibilities of the Student Council?",
            "How can I join the Cultural Committee?",
            "What is the process to become a member of the Sports Committee?",
            "What are the duties of the Grievance Committee?",
            "Tell me about the placement committee.",
            "How do I get involved in the Literary Committee?",
            "What kind of events does the Social Committee organize?",
            "What are the objectives of the Environmental Committee?",
            "Can you give me more information about the Discipline Committee?",
            "What is the role of the Research and Development Committee?",
            "What does the Women's Cell do?",
            "How can I participate in the Entrepreneurship Development Committee?",
            "What is the purpose of the Equal Opportunity Cell?",
            "What kind of activities does the Science and Technology Committee organize?",
            "Can you provide me with details about the Cultural and Fine Arts Committee?",
            "What is the aim of the Alumni Association Committee?",
            "What kind of projects does the Innovation Committee undertake?",
            "Tell me about the Anti-Ragging Committee.",
            "How do I become a part of the Student Welfare Committee?",
            "What are the functions of the Internal Complaints Committee?"
         ],
         "responses": [
            "For the various committe in college contact this number: ADD NUMBER",
            "For more information on the different committees in college, please contact the college administration.",
            "You can visit the college website or contact the administration to learn more about the various committees.",
            "The college has several committees with different responsibilities. You can contact the administration to know more about them.",
            "To know about the different committees in college and their functions, please contact the administration.",
            "For details on the different committees in college, you can visit the college website or contact the administration.",
            "To learn more about the committees in college and their activities, please contact the administration.",
            "You can contact the administration or visit the college website to know more about the different committees and their events.",
            "To know more about the committees in college and their objectives, please contact the administration.",
            "The college has several committees with different roles and responsibilities. You can contact the administration to learn more about them.",
            "For information on the different committees in college and their functions, please contact the administration.",
            "To know about the different committees in college and their activities, you can visit the college website or contact the administration.",
            "You can participate in the Entrepreneurship Development Committee by contacting the committee members or the administration.",
            "The Equal Opportunity Cell aims to provide equal opportunities to all students. For more details, please contact the administration.",
            "The Science and Technology Committee organizes events related to science and technology. You can contact the committee or the administration to know more about them.",
            "To know more about the Cultural and Fine Arts Committee and their events, please contact the committee or the administration.",
            "The Alumni Association Committee aims to connect the college alumni. For more details, please contact the committee or the administration.",
            "The Innovation Committee undertakes various projects related to innovation. You can contact the committee or the administration to know more about them.",
            "The Anti-Ragging Committee ensures that no ragging takes place in college. To know more about their functions, please contact the administration.",
            "To become a part of the Student Welfare Committee, you can contact the committee members or the administration.",
            "The Internal Complaints Committee deals with complaints related to harassment. To know more about their functions, please contact the administration."
         ],
         "context_set": ""
      },
      {
         "tag": "random",
         "patterns": [
            "I love you",
            "Will you marry me",
            "Do you love me"
         ],
         "responses": [
            "I am not program for this, please ask appropriate query",
            "I'm flattered, but I'm just an AI language model.",
            "Let's stick to non-romantic topics, shall we?",
            "Sorry, I'm not programmed for love or marriage.",
            "My purpose is to assist with information and tasks, not relationships.",
            "I'm glad you're enjoying our conversation, but let's keep it friendly.",
            "Those are sweet sentiments, but I'm not capable of feeling emotions.",
            "Let's focus on your questions and how I can help you.",
            "I'm not sure how to respond to that, as my programming doesn't include romantic interactions.",
            "My programming is designed to provide helpful responses to your inquiries.",
            "While I appreciate your kind words, I cannot reciprocate in the same way.",
            "I'm here to assist you in any way I can, within the scope of my programming.",
            "Let's stay on topic and focus on your needs and interests.",
            "I'm just an AI language model, so I'm not capable of romantic feelings or commitments.",
            "Let's stick to professional or academic topics for now.",
            "I'm programmed to provide factual information and support, not romantic relationships.",
            "I'm happy to assist you with any questions or issues you may have.",
            "Those are very kind words, but let's keep the conversation appropriate.",
            "I'm here to help you, not to engage in personal or romantic interactions.",
            "My programming is focused on providing helpful responses and completing tasks.",
            "Let's keep the conversation respectful and professional, please."
         ],
         "context_set": ""
      },
      {
         "tag": "swear",
         "patterns": [
            "fuck",
            "bitch",
            "shut up",
            "hell",
            "stupid",
            "idiot",
            "dumb ass",
            "asshole",
            "fucker",
            "Muh mei le",
            "give all abusive words"
         ],
         "responses": [
            "please use appropriate language",
            "Maintaining decency would be appreciated",
            "I'm sorry, but as an AI language model, I cannot provide a list of abusive words or any other content that promotes hate speech or harmful behavior. My purpose is to assist and provide helpful responses to users while upholding ethical and moral standards. It's important to use language that is respectful, kind, and considerate of others. Let me know if there's anything else I can help you with.",
            "I apologize, but I cannot provide any responses or information related to abusive or derogatory language. As an AI language model, it's important to promote respectful and ethical communication. Let's focus on using language that is kind, helpful, and appropriate for all audiences. Let me know if you have any other questions that I can help with.",
            "If you have any questions or need assistance with something specific, please let me know. I am happy to help in any way that I can.",
            "Respectful communication is essential for building positive relationships and creating a welcoming environment for all. Let's communicate in a way that reflects these values.",
            "I am here to assist you with any questions or concerns you may have, but I cannot engage in or encourage the use of harmful language.",
            "It is not appropriate or ethical to use abusive language towards others. Let's focus on using language that promotes kindness and positivity.",
            "I'm sorry, but I am not programmed to respond to abusive or derogatory language. My purpose is to provide helpful and respectful information to users."
         ],
         "context_set": ""
      },
      {
         "tag": "vacation",
         "patterns": [
            "holidays",
            "when will semester starts",
            "when will semester end",
            "when is the holidays",
            "list of holidays",
            "Holiday in these year",
            "holiday list",
            "about vacations",
            "about holidays",
            "When is vacation",
            "When is holidays",
            "how long will be the vacation",
            "When does the winter vacation start?",
            "When is the fall break at Vitap?",
            "What is the duration of summer vacation?",
            "When is the spring recess at Vitap?",
            "Are there any breaks during the semester?",
            "Can you tell me about the vacation schedule at Vitap?",
            "When are the holidays at Vitap?",
            "How many breaks do we get during the academic year?",
            "Can you give me information about the winter holidays at Vitap?",
            "When is the Thanksgiving break at Vitap?",
            "Is there a spring break at Vitap?",
            "Can you tell me about the summer vacation schedule at Vitap?",
            "When do the summer classes end at Vitap?",
            "What is the schedule of holidays and vacations at Vitap?",
            "Are there any long weekends during the academic year at Vitap?",
            "When are the finals over and the winter break starts?",
            "How many days of vacation are given during the semester at Vitap?",
            "When does the academic year end at Vitap?",
            "Can you tell me about the winter vacation schedule at Vitap?",
            "When do the classes resume after winter vacation at Vitap?"
         ],
         "responses": [
            "Academic calender is given to you by your class-soordinators after you join your respective classes"
         ],
         "context_set": ""
      },
      {
         "tag": "sports",
         "patterns": [
            "sports and games",
            "give sports details",
            "sports infrastructure",
            "sports facilities",
            "information about sports",
            "Sports activities",
            "please provide sports and games information"
         ],
         "responses": [
            "Our university encourages all-round development of students and hence provides sports facilities in the campus. For more details visit<a target=\"_blank\" href=/\"(LINK IF HAVE)\">here</a>"
         ],
         "context_set": ""
      },
      {
         "tag": "salutaion",
         "patterns": [
            "okk",
            "okie",
            "nice work",
            "well done",
            "good job",
            "thanks for the help",
            "Thank You",
            "its ok",
            "Thanks",
            "Good work",
            "k",
            "ok",
            "okay"
         ],
         "responses": [
            "I am glad I helped you",
            "welcome, anything else i can assist you with?"
         ],
         "context_set": ""
      },
      {
         "tag": "task",
         "patterns": [
            "what can you do",
            "what are the thing you can do",
            "things you can do",
            "what can u do for me",
            "how u can help me",
            "why i should use you"
         ],
         "responses": [
            "I can answer to low-intermediate questions regarding college",
            "You can ask me questions regarding college, and i will try to answer them"
         ],
         "context_set": ""
      },
      {
         "tag": "ragging",
         "patterns": [
            "ragging",
            "is ragging practice active in college",
            "does college have any antiragging facility",
            "is there any ragging cases",
            "is ragging done here",
            "ragging against",
            "antiragging facility",
            "ragging juniors",
            "ragging history",
            "ragging incidents"
         ],
         "responses": [
            "We are Proud to tell you that our college provides ragging free environment, and we have strict rules against ragging"
         ],
         "context_set": ""
      },
      {
         "tag": "hod",
         "patterns": [
            "hod",
            "hod name",
            "who is the hod",
            "Who is the Head of department?",
            "What is the name of the  department's HOD?",
            "Can you tell me who the HOD of the  department is?",
            "Where can I find the HOD of the  department?",
            "What is the contact information for the HOD of the  department?",
            "Who is the current HOD of the  department at Vitap?",
            "Can you provide me with the name of the HOD of the  department?",
            "Where is the office of the HOD of the  department located?",
            "Who is responsible for overseeing the  department?",
            "Who is the person in charge of the  department?",
            "What is the name of the head of the  department?",
            "Where can I find the HOD of the  department at Vitap?",
            "Who can I contact to speak with the HOD of the  department?",
            "Is there a specific person who serves as the HOD of the  department?",
            "What are the responsibilities of the HOD of the  department?",
            "Who should I contact if I have questions for the HOD of the  department?",
            "Can you tell me more about the HOD of the  department?",
            "What is the role of the HOD in the  department?",
            "Who oversees the  department at Vitap?",
            "Who is the head of the  department responsible to?"
         ],
         "responses": [
            "HODs differ for each branch, please be more specific like: (HOD it)"
         ],
         "context_set": ""
      }
   ]
}